{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report linking deployment documentation and components for publishing the site on the Internet Computer.",
  "frontend-file-summaries.txt": "Text file containing autogenerated summaries for all frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for building and deploying the site to the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, dark mode variables, and base styles.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and mounting root for the React app.",
  "frontend/src/App.tsx": "Top-level React component that renders the MarketingPage.",
  "frontend/src/components/Footer.tsx": "Footer with business copyright, caffeine.ai attribution, and dynamic hostname tracking.",
  "frontend/src/components/MarketingPage.tsx": "Page layout assembling navigation, all content sections, and footer.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section featuring booking phone number, availability info, pricing note, and CTA button.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with main heading, subheading, pricing note, and call-to-action buttons.",
  "frontend/src/components/sections/ServicesSection.tsx": "Services grid showing three offerings with icons and descriptions.",
  "frontend/src/components/sections/VehicleGallerySection.tsx": "Vehicle gallery displaying three bus images with captions and comfort messaging.",
  "frontend/src/components/sections/WhyChooseSection.tsx": "Renders the Why Choose section using branding data and mapped Lucide icons in a responsive grid layout.",
  "frontend/src/components/TopNav.tsx": "Sticky navigation bar with smooth-scroll links and responsive mobile menu.",
  "frontend/src/content/branding.ts": "Provides centralized branding text, contact info, and structured data arrays for services and why‑choose items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, status handling, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module exporting nothing because the site uses static content only.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for a blue‑and‑white design with light/dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors from CSS vars, plugins, and container settings.",
  "project_state.json": "Describes project metadata, requirements, existing features, and the marketing site’s overall goals."
}